# Index, Select, And Filter pandas Dataframes
### Import modules

In [1]:
import pandas as pd

### Create a dataframe

In [2]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

            coverage   name  reports  year
Cochice           25  Jason        4  2012
Pima              94  Molly       24  2012
Santa Cruz        57   Tina       31  2013
Maricopa          62   Jake        2  2014
Yuma              70    Amy        3  2014

### View a column of the dataframe

In [3]:
df['name']

Cochice       Jason
Pima          Molly
Santa Cruz     Tina
Maricopa       Jake
Yuma            Amy
Name: name, dtype: object

### View two columns of the dataframe

In [4]:
df[['name','reports']]

             name  reports
Cochice     Jason        4
Pima        Molly       24
Santa Cruz   Tina       31
Maricopa     Jake        2
Yuma          Amy        3

### View the first two rows of the dataframe

In [5]:
df[:2]

         coverage   name  reports  year
Cochice        25  Jason        4  2012
Pima           94  Molly       24  2012

### View all rows where coverage is more than 50

In [6]:
df[df['coverage']>50]

            coverage   name  reports  year
Pima              94  Molly       24  2012
Santa Cruz        57   Tina       31  2013
Maricopa          62   Jake        2  2014
Yuma              70    Amy        3  2014

### View a row

In [8]:
df.loc['Maricopa']

coverage      62
name        Jake
reports        2
year        2014
Name: Maricopa, dtype: object

In [9]:
df.loc[:,'coverage']

Cochice       25
Pima          94
Santa Cruz    57
Maricopa      62
Yuma          70
Name: coverage, dtype: int64

In [10]:
df.loc['Yuma','coverage']

70

Source: https://chrisalbon.com/python/pandas_index_select_and_filter.html